In [38]:
import pandas as pd

In [39]:
# Mapping lets you format an entire DataFrame
sales_df = pd.read_csv("Resources\sales_data.csv")
sales_df.head()

,Country,Item Type,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Tuvalu,Baby Food,9925,255.28,159.42,2533654.00,1582243.50,951410.50
1,Grenada,Cereal,2804,205.70,117.11,576782.80,328376.44,248406.36
2,Russia,Office Supplies,1779,651.21,524.96,1158502.59,933903.84,224598.75
3,Sao Tome and Principe,Fruits,8102,9.33,6.92,75591.66,56065.84,19525.82
4,Rwanda,Office Supplies,5062,651.21,524.96,3296425.02,2657347.52,639077.50

In [40]:
sales_df.dtypes

Country           object
Item Type         object
Units Sold         int64
Unit Price       float64
Unit Cost        float64
Total Revenue    float64
Total Cost       float64
Total Profit     float64
dtype: object

In [41]:
sales_df.columns

Index(['Country', 'Item Type', 'Units Sold', 'Unit Price', 'Unit Cost',
       'Total Revenue', 'Total Cost', 'Total Profit'],
      dtype='object')

In [56]:
# Use map() to format:
# Units Sold with comma notation
# Unit Price, Unit Cost, Total Revenue, Total Cost, and Total Profit 
# with a dollar sign, comma notation, and to two decimal places.

In [57]:
# Units Sold with comma notation
#sales_df["Units Sold"] = sales_df["Units Sold"].map("{:,}".format)
sales_df["Units Sold"].head()

0    9,925
1    2,804
2    1,779
3    8,102
4    5,062
Name: Units Sold, dtype: object

In [58]:
# Unit Price, 
#sales_df["Unit Price"] = sales_df["Unit Price"].map("${:.2f}".format)
sales_df["Unit Price"].head(3)

0    $255.28
1    $205.70
2    $651.21
Name: Unit Price, dtype: object

In [62]:
#Unit Cost, 
# with a dollar sign, comma notation, and to two decimal places.

#sales_df["Unit Cost"] = sales_df["Unit Cost"].map("${:,.2f}".format)
sales_df["Unit Cost"].head(3)

0    $159.42
1    $117.11
2    $524.96
Name: Unit Cost, dtype: object

In [63]:
# Total Revenue, 
# with a dollar sign, comma notation, and to two decimal places.
#sales_df["Total Revenue"] = sales_df["Total Revenue"].map("${:,.2f}".format)
sales_df["Total Revenue"].head(3)

0    $2,533,654.00
1      $576,782.80
2    $1,158,502.59
Name: Total Revenue, dtype: object

In [64]:
# Total Cost,
# with a dollar sign, comma notation, and to two decimal places.
#sales_df["Total Cost"] = sales_df["Total Cost"].map("${:,.2f}".format)
sales_df["Total Cost"].head(3)

0    $1,582,243.50
1      $328,376.44
2      $933,903.84
Name: Total Cost, dtype: object

In [65]:
# Total Profit 
# with a dollar sign, comma notation, and to two decimal places.
#sales_df["Total Profit"] = sales_df["Total Profit"].map("${:,.2f}".format)
sales_df["Total Profit"].head(3)

0    $951,410.50
1    $248,406.36
2    $224,598.75
Name: Total Profit, dtype: object

In [55]:
# Mapping has changed the datatypes of the columns to strings
sales_df.dtypes

Country          object
Item Type        object
Units Sold       object
Unit Price       object
Unit Cost        object
Total Revenue    object
Total Cost       object
Total Profit     object
dtype: object

NameError: name 'sales_df' is not defined